IDEA StatiCa Open Model
CutBeamByBeamData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Provides data of the cut objec by object
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CutBeamByBeamData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CutBeamByBeamData
Public Class CutBeamByBeamData
public ref class CutBeamByBeamData
The CutBeamByBeamData type exposes the following members.
Constructors
Name | Description
CutBeamByBeamData
Initializes a new instance of the CutBeamByBeamData class
Top
Properties
Name | Description
CuttingObject
 Cutting by object
IsWeld
 is cut welded
ModifiedObject
 Modified object
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace